In [13]:
!pip install ipython

Requirement already satisfied: ipython in c:\py\ds-200v\.venv\lib\site-packages (8.38.0)
Requirement already satisfied: colorama in c:\py\ds-200v\.venv\lib\site-packages (from ipython) (0.4.6)
Requirement already satisfied: decorator in c:\py\ds-200v\.venv\lib\site-packages (from ipython) (5.2.1)
Requirement already satisfied: exceptiongroup in c:\py\ds-200v\.venv\lib\site-packages (from ipython) (1.3.1)
Requirement already satisfied: jedi>=0.16 in c:\py\ds-200v\.venv\lib\site-packages (from ipython) (0.19.2)
Requirement already satisfied: matplotlib-inline in c:\py\ds-200v\.venv\lib\site-packages (from ipython) (0.2.1)
Requirement already satisfied: prompt_toolkit<3.1.0,>=3.0.41 in c:\py\ds-200v\.venv\lib\site-packages (from ipython) (3.0.52)
Requirement already satisfied: pygments>=2.4.0 in c:\py\ds-200v\.venv\lib\site-packages (from ipython) (2.19.2)
Requirement already satisfied: stack_data in c:\py\ds-200v\.venv\lib\site-packages (from ipython) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in c:\py\ds-200v\.venv\lib\site-packages (from ipython) (5.14.3)
Requirement already satisfied: typing_extensions>=4.6 in c:\py\ds-200v\.venv\lib\site-packages (from ipython) (4.15.0)
Requirement already satisfied: wcwidth in c:\py\ds-200v\.venv\lib\site-packages (from prompt_toolkit<3.1.0,>=3.0.41->ipython) (0.2.14)
Requirement already satisfied: parso<0.9.0,>=0.8.4 in c:\py\ds-200v\.venv\lib\site-packages (from jedi>=0.16->ipython) (0.8.5)
Requirement already satisfied: executing>=1.2.0 in c:\py\ds-200v\.venv\lib\site-packages (from stack_data->ipython) (2.2.1)
Requirement already satisfied: asttokens>=2.1.0 in c:\py\ds-200v\.venv\lib\site-packages (from stack_data->ipython) (3.0.1)
Requirement already satisfied: pure-eval in c:\py\ds-200v\.venv\lib\site-packages (from stack_data->ipython) (0.2.3)

WARNING: Ignoring invalid distribution -yspark (c:\py\ds-200v\.venv\lib\site-packages)
WARNING: Ignoring invalid distribution -yspark (c:\py\ds-200v\.venv\lib\site-packages)
WARNING: Ignoring invalid distribution -yspark (c:\py\ds-200v\.venv\lib\site-packages)

[notice] A new release of pip is available: 25.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [5]:
import pandas as pd
import numpy as np
from IPython.display import display as dp
import os

In [79]:
base = "VideoAnalisis/documents"
df_ventas = pd.read_csv(os.path.join(base, "Ventas.csv"))
df_inventario = pd.read_csv(os.path.join(base, "Inventario.csv"))
df_productos = pd.read_csv(os.path.join(base, "Productos.csv"))
df_tienda = pd.read_csv(os.path.join(base, "Tiendas.csv"))

In [80]:
df_ventas.head()

,VentaID,Fecha,ProductoID,TiendaID,Cantidad,PrecioUnitario,Ingreso
0,1,2025-04-22,21,4,2,360.67,721.34
1,2,2025-02-19,22,3,1,390.92,390.92
2,3,2025-04-15,7,2,2,326.05,652.10
3,4,2025-01-05,23,1,2,312.51,625.02
4,5,2024-12-26,31,9,2,462.00,924.00

In [81]:
df_inventario.head()

   ProductoID  StockActual
0           1           10
1           2          130
2           3           85
3           4          135
4           5           63

In [82]:
df_productos.head()

   ProductoID       NombreProducto    Categoría  PrecioUnitario  CostoUnitario
0           1   Electrónica Blue 1  Electrónica          275.40         116.96
1           2      Juguetes Face 2     Juguetes          202.19          62.52
2           3    Deportes Notice 3     Deportes          258.87          21.45
3           4   Electrónica Five 4  Electrónica          467.99         265.94
4           5  Electrónica Black 5  Electrónica          402.40          95.72

In [83]:
df_tienda.head()

   TiendaID NombreTienda         Ciudad   Canal
0         1     Tienda 1    New Michael  Online
1         2     Tienda 2  South Natasha  Físico
2         3     Tienda 3  South Anthony  Online
3         4     Tienda 4    Murphyshire  Físico
4         5     Tienda 5    New Kristen  Físico

In [84]:
df_analisis = df_ventas.merge(df_inventario, on = "ProductoID", how= "left")

In [85]:
df_analisis

,VentaID,Fecha,ProductoID,TiendaID,Cantidad,PrecioUnitario,Ingreso,StockActual
0,1,2025-04-22,21,4,2,360.67,721.34,166
1,2,2025-02-19,22,3,1,390.92,390.92,66
2,3,2025-04-15,7,2,2,326.05,652.10,191
3,4,2025-01-05,23,1,2,312.51,625.02,133
4,5,2024-12-26,31,9,2,462.00,924.00,4
...,...,...,...,...,...,...,...,...
995,996,2025-05-12,18,2,4,256.49,1025.96,180
996,997,2024-12-23,15,9,2,483.51,967.02,135
997,998,2025-05-19,38,10,2,392.00,784.00,100
998,999,2025-02-24,48,3,1,294.30,294.30,46
999,1000,2024-12-13,30,10,2,467.99,935.98,158

In [86]:
df_analisis = df_analisis.merge(df_tienda, on = "TiendaID", how= "left")

In [87]:
df_analisis

,VentaID,Fecha,ProductoID,TiendaID,Cantidad,PrecioUnitario,Ingreso,StockActual,NombreTienda,Ciudad,Canal
0,1,2025-04-22,21,4,2,360.67,721.34,166,Tienda 4,Murphyshire,Físico
1,2,2025-02-19,22,3,1,390.92,390.92,66,Tienda 3,South Anthony,Online
2,3,2025-04-15,7,2,2,326.05,652.10,191,Tienda 2,South Natasha,Físico
3,4,2025-01-05,23,1,2,312.51,625.02,133,Tienda 1,New Michael,Online
4,5,2024-12-26,31,9,2,462.00,924.00,4,Tienda 9,Nobleside,Físico
...,...,...,...,...,...,...,...,...,...,...,...
995,996,2025-05-12,18,2,4,256.49,1025.96,180,Tienda 2,South Natasha,Físico
996,997,2024-12-23,15,9,2,483.51,967.02,135,Tienda 9,Nobleside,Físico
997,998,2025-05-19,38,10,2,392.00,784.00,100,Tienda 10,Frederickburgh,Físico
998,999,2025-02-24,48,3,1,294.30,294.30,46,Tienda 3,South Anthony,Online
999,1000,2024-12-13,30,10,2,467.99,935.98,158,Tienda 10,Frederickburgh,Físico

In [88]:
df_analisis = df_analisis.merge(df_productos, on = ["ProductoID", "PrecioUnitario"], how= "left")

In [89]:
df_analisis

,VentaID,Fecha,ProductoID,TiendaID,Cantidad,PrecioUnitario,Ingreso,StockActual,NombreTienda,Ciudad,Canal,NombreProducto,Categoría,CostoUnitario
0,1,2025-04-22,21,4,2,360.67,721.34,166,Tienda 4,Murphyshire,Físico,Deportes Protect 21,Deportes,20.35
1,2,2025-02-19,22,3,1,390.92,390.92,66,Tienda 3,South Anthony,Online,Electrónica Serve 22,Electrónica,349.90
2,3,2025-04-15,7,2,2,326.05,652.10,191,Tienda 2,South Natasha,Físico,Hogar East 7,Hogar,25.60
3,4,2025-01-05,23,1,2,312.51,625.02,133,Tienda 1,New Michael,Online,Deportes About 23,Deportes,177.18
4,5,2024-12-26,31,9,2,462.00,924.00,4,Tienda 9,Nobleside,Físico,Ropa Across 31,Ropa,341.72
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,2025-05-12,18,2,4,256.49,1025.96,180,Tienda 2,South Natasha,Físico,Ropa Leave 18,Ropa,323.94
996,997,2024-12-23,15,9,2,483.51,967.02,135,Tienda 9,Nobleside,Físico,Ropa Statement 15,Ropa,31.13
997,998,2025-05-19,38,10,2,392.00,784.00,100,Tienda 10,Frederickburgh,Físico,Electrónica Budget 38,Electrónica,112.89
998,999,2025-02-24,48,3,1,294.30,294.30,46,Tienda 3,South Anthony,Online,Juguetes Rule 48,Juguetes,378.19
999,1000,2024-12-13,30,10,2,467.99,935.98,158,Tienda 10,Frederickburgh,Físico,Electrónica Character 30,Electrónica,32.57

In [90]:
df_analisis.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   VentaID         1000 non-null   int64
 1   Fecha           1000 non-null   object
 2   ProductoID      1000 non-null   int64
 3   TiendaID        1000 non-null   int64
 4   Cantidad        1000 non-null   int64
 5   PrecioUnitario  1000 non-null   float64
 6   Ingreso         1000 non-null   float64
 7   StockActual     1000 non-null   int64
 8   NombreTienda    1000 non-null   object
 9   Ciudad          1000 non-null   object
 10  Canal           1000 non-null   object
 11  NombreProducto  1000 non-null   object
 12  Categoría       1000 non-null   object
 13  CostoUnitario   1000 non-null   float64
dtypes: float64(3), int64(5), object(6)
memory usage: 109.5+ KB

In [91]:
df_analisis["Fecha"] = pd.to_datetime(df_analisis["Fecha"])

In [92]:
df_analisis.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   VentaID         1000 non-null   int64
 1   Fecha           1000 non-null   datetime64[ns]
 2   ProductoID      1000 non-null   int64
 3   TiendaID        1000 non-null   int64
 4   Cantidad        1000 non-null   int64
 5   PrecioUnitario  1000 non-null   float64
 6   Ingreso         1000 non-null   float64
 7   StockActual     1000 non-null   int64
 8   NombreTienda    1000 non-null   object
 9   Ciudad          1000 non-null   object
 10  Canal           1000 non-null   object
 11  NombreProducto  1000 non-null   object
 12  Categoría       1000 non-null   object
 13  CostoUnitario   1000 non-null   float64
dtypes: datetime64[ns](1), float64(3), int64(5), object(5)
memory usage: 109.5+ KB

In [93]:
df = df_analisis.copy()

In [94]:
df["Mes_numero"] = df["Fecha"].dt.month
df["Mes_nombre"] = df["Fecha"].dt.month_name()

In [95]:
df

,VentaID,Fecha,ProductoID,TiendaID,Cantidad,PrecioUnitario,Ingreso,StockActual,NombreTienda,Ciudad,Canal,NombreProducto,Categoría,CostoUnitario,Mes_numero,Mes_nombre
0,1,2025-04-22,21,4,2,360.67,721.34,166,Tienda 4,Murphyshire,Físico,Deportes Protect 21,Deportes,20.35,4,April
1,2,2025-02-19,22,3,1,390.92,390.92,66,Tienda 3,South Anthony,Online,Electrónica Serve 22,Electrónica,349.90,2,February
2,3,2025-04-15,7,2,2,326.05,652.10,191,Tienda 2,South Natasha,Físico,Hogar East 7,Hogar,25.60,4,April
3,4,2025-01-05,23,1,2,312.51,625.02,133,Tienda 1,New Michael,Online,Deportes About 23,Deportes,177.18,1,January
4,5,2024-12-26,31,9,2,462.00,924.00,4,Tienda 9,Nobleside,Físico,Ropa Across 31,Ropa,341.72,12,December
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,2025-05-12,18,2,4,256.49,1025.96,180,Tienda 2,South Natasha,Físico,Ropa Leave 18,Ropa,323.94,5,May
996,997,2024-12-23,15,9,2,483.51,967.02,135,Tienda 9,Nobleside,Físico,Ropa Statement 15,Ropa,31.13,12,December
997,998,2025-05-19,38,10,2,392.00,784.00,100,Tienda 10,Frederickburgh,Físico,Electrónica Budget 38,Electrónica,112.89,5,May
998,999,2025-02-24,48,3,1,294.30,294.30,46,Tienda 3,South Anthony,Online,Juguetes Rule 48,Juguetes,378.19,2,February
999,1000,2024-12-13,30,10,2,467.99,935.98,158,Tienda 10,Frederickburgh,Físico,Electrónica Character 30,Electrónica,32.57,12,December

In [96]:
ingresos_por_mes = df.groupby(["Mes_nombre", "Canal"])["Ingreso"].sum().reset_index()

In [97]:
ingresos_por_mes

   Mes_nombre   Canal    Ingreso
0       April  Físico   81404.12
1       April  Online   49608.81
2    December  Físico  102883.32
3    December  Online   69889.50
4    February  Físico   99132.95
5    February  Online   76536.32
6     January  Físico   86787.74
7     January  Online   70609.45
8       March  Físico  107109.68
9       March  Online   67297.29
10        May  Físico   47048.80
11        May  Online   42198.36
12   November  Físico   35131.58
13   November  Online   25671.64

In [98]:
ingresos_por_mes = ingresos_por_mes.rename(columns={"Mes_nombre" : "Mes"})

In [99]:
ingresos_por_mes

         Mes   Canal    Ingreso
0      April  Físico   81404.12
1      April  Online   49608.81
2   December  Físico  102883.32
3   December  Online   69889.50
4   February  Físico   99132.95
5   February  Online   76536.32
6    January  Físico   86787.74
7    January  Online   70609.45
8      March  Físico  107109.68
9      March  Online   67297.29
10       May  Físico   47048.80
11       May  Online   42198.36
12  November  Físico   35131.58
13  November  Online   25671.64

In [100]:
df

,VentaID,Fecha,ProductoID,TiendaID,Cantidad,PrecioUnitario,Ingreso,StockActual,NombreTienda,Ciudad,Canal,NombreProducto,Categoría,CostoUnitario,Mes_numero,Mes_nombre
0,1,2025-04-22,21,4,2,360.67,721.34,166,Tienda 4,Murphyshire,Físico,Deportes Protect 21,Deportes,20.35,4,April
1,2,2025-02-19,22,3,1,390.92,390.92,66,Tienda 3,South Anthony,Online,Electrónica Serve 22,Electrónica,349.90,2,February
2,3,2025-04-15,7,2,2,326.05,652.10,191,Tienda 2,South Natasha,Físico,Hogar East 7,Hogar,25.60,4,April
3,4,2025-01-05,23,1,2,312.51,625.02,133,Tienda 1,New Michael,Online,Deportes About 23,Deportes,177.18,1,January
4,5,2024-12-26,31,9,2,462.00,924.00,4,Tienda 9,Nobleside,Físico,Ropa Across 31,Ropa,341.72,12,December
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,2025-05-12,18,2,4,256.49,1025.96,180,Tienda 2,South Natasha,Físico,Ropa Leave 18,Ropa,323.94,5,May
996,997,2024-12-23,15,9,2,483.51,967.02,135,Tienda 9,Nobleside,Físico,Ropa Statement 15,Ropa,31.13,12,December
997,998,2025-05-19,38,10,2,392.00,784.00,100,Tienda 10,Frederickburgh,Físico,Electrónica Budget 38,Electrónica,112.89,5,May
998,999,2025-02-24,48,3,1,294.30,294.30,46,Tienda 3,South Anthony,Online,Juguetes Rule 48,Juguetes,378.19,2,February
999,1000,2024-12-13,30,10,2,467.99,935.98,158,Tienda 10,Frederickburgh,Físico,Electrónica Character 30,Electrónica,32.57,12,December

In [101]:
top_10_productos_ingresos = df.groupby("NombreProducto")["Ingreso"].sum().sort_values(ascending=False).head(10).reset_index()

In [102]:
top_10_productos_ingresos

             NombreProducto   Ingreso
0          Deportes Half 24  40371.21
1        Electrónica Five 4  39311.16
2            Ropa Across 31  38346.00
3           Ropa Another 17  33104.76
4         Ropa Statement 15  32395.17
5      Electrónica Serve 22  31273.60
6          Juguetes Seat 11  30913.19
7              Ropa Cell 14  29202.80
8  Electrónica Character 30  29015.38
9        Deportes Market 43  28899.78

In [103]:
top_10_productos_unidades = df.groupby("NombreProducto")["Cantidad"].sum().sort_values(ascending=False).head(10).reset_index()

In [104]:
top_10_productos_unidades

           NombreProducto  Cantidad
0            Ropa Cell 14        88
1            Hogar East 7        84
2      Electrónica Five 4        84
3          Ropa Across 31        83
4        Deportes Half 24        81
5  Electrónica Teacher 50        80
6    Electrónica Serve 22        80
7       Deportes Notice 3        79
8      Deportes Market 43        78
9         Ropa Another 17        78

In [105]:
df["Margen"] = df["PrecioUnitario"] - df["CostoUnitario"]

In [106]:
Margen = df.groupby("Categoría")["Margen"].mean().reset_index().round(2)

In [107]:
Margen

     Categoría  Margen
0     Deportes  247.41
1  Electrónica  129.40
2        Hogar  160.05
3     Juguetes   58.50
4         Ropa  162.49

In [119]:
df.loc[df["StockActual"] < 50, ["NombreProducto", "NombreTienda", "StockActual"]].drop_duplicates().sort_values("StockActual", ascending = False)

         NombreProducto NombreTienda  StockActual
280  Juguetes Beyond 37     Tienda 1           49
101  Juguetes Beyond 37     Tienda 3           49
229  Juguetes Beyond 37     Tienda 7           49
162  Juguetes Beyond 37    Tienda 10           49
149  Juguetes Beyond 37     Tienda 8           49
..                  ...          ...          ...
160      Ropa Across 31    Tienda 10            4
161      Ropa Across 31     Tienda 2            4
164      Ropa Across 31     Tienda 5            4
355      Ropa Across 31     Tienda 4            4
4        Ropa Across 31     Tienda 9            4

[93 rows x 3 columns]

In [121]:
df.groupby(["NombreTienda", "Ciudad", "Mes_nombre"])["Ingreso"].sum().reset_index().sort_values(by = "Ingreso", ascending = True).head(5)

   NombreTienda            Ciudad Mes_nombre  Ingreso
34     Tienda 4       Murphyshire   November  1970.23
48     Tienda 6         Smithstad   November  2833.83
20     Tienda 2     South Natasha   November  3031.09
40     Tienda 5       New Kristen        May  3887.75
49     Tienda 7  West Chadborough      April  4319.52

In [125]:
df.groupby(["Mes_nombre", "Canal"])["Ingreso"].sum().reset_index().sort_values(by = "Ingreso", ascending = True)

   Mes_nombre   Canal    Ingreso
13   November  Online   25671.64
12   November  Físico   35131.58
11        May  Online   42198.36
10        May  Físico   47048.80
1       April  Online   49608.81
9       March  Online   67297.29
3    December  Online   69889.50
7     January  Online   70609.45
5    February  Online   76536.32
0       April  Físico   81404.12
6     January  Físico   86787.74
4    February  Físico   99132.95
2    December  Físico  102883.32
8       March  Físico  107109.68

In [111]:
df.to_csv("Analisis_PT.csv", index = False, encoding = "utf-8-sig")

In [ ]:
stock_bajo = (
    df.loc[df["StockActual"] < 50, ["NombreProducto", "StockActual"]]
    .drop_duplicates()
    .sort_values("StockActual", ascending=False)
)

stock_bajo.to_csv("Stock_Bajo.csv", index=False, encoding="utf-8-sig")

In [116]:
stock_bajo

              NombreProducto  StockActual
101       Juguetes Beyond 37           49
85               Ropa Art 29           47
79          Juguetes Rule 48           46
31           Deportes Law 35           39
165  Electrónica Probably 41           34
11          Juguetes Team 26           30
6              Hogar Such 13           28
60             Ropa Sense 39           13
23        Electrónica Blue 1           10
63          Deportes Half 24            9
4             Ropa Across 31            4

In [113]:
df.isnull().sum()

VentaID           0
Fecha             0
ProductoID        0
TiendaID          0
Cantidad          0
PrecioUnitario    0
Ingreso           0
StockActual       0
NombreTienda      0
Ciudad            0
Canal             0
NombreProducto    0
Categoría         0
CostoUnitario     0
Mes_numero        0
Mes_nombre        0
Margen            0
dtype: int64

Ingreso
1871.96    18
467.99     10
1477.40     9
1327.40     9
978.15      9
           ..
144.39      1
1282.45     1
961.86      1
970.68      1
1518.80     1
Name: count, Length: 239, dtype: int64